class_name: Sequential
config:
- class_name: Dense
  config:
    activation: relu
    batch_input_shape: !!python/tuple [null, 4]
    units: 10
- class_name: Dense
  config:
    activation: relu
    units: 5
- class_name: Dense
  config:
    activation: relu
    units: 2